import Accordion, { AccordionItem } from "../components/Accordion";
import ColorWrapper from "../wrappers/ColorWrapper";
import SwipeWrapper from "../wrappers/SwipeWrapper";

export default function FAQ() {
  const items = [
    {
      title: "Хэрхэн QR кодоор зорчих вэ? ",
      content:
        "Ubcard аппликейшн руу нэвтэрч орсны дараа та цэнэглэх товчийг дарж дансаа цэнэглэсний дараа QR код идэвхжин зорчих боломжтой болно. ",
    },
    {
      title:
        "Хэрхэн UBcard аппликейшн хэрэглэгчид хоорондоо мөнгө шилжүүлэх вэ? ",
      content:
        "Цэнэглэх товчны хажууд байрлах сум заасан товч дээр дарж тухайн аппликейшн хэрэглэгчийн бүртгэлтэй дугаарыг оруулан илгээх товчийг дарна. Үүний дараа шилжүүлэх мөнгөн дүнг хийж Илгээх товч дарснаар амжилттай илгээгдэнэ.",
    },
    {
      title: "Биет картын үлдэгдэлийг хэрхэн хянах вэ?",
      content:
        "Баруун дээд буланд байрлах товч дээр даран карт уншуулах хэсгийг дарснаар картын үлдэгдлийг харах боломжтой. Түүнчлэн Хэрэглэгч та биет картыг аппликейшн дээр бүртгүүлснээр гээсэн үед ашиглах боломжгүй болгох эсвэл зорчилт болон цэнэглэлтийн түүхийг харах боломжтой юм.",
    },
    {
      title: "Автобусны чиглэлүүдийг хэрхэн харах вэ?",
      content:
        "Баруун доор байрлах газрын зурагт бүхий товч дээр дарснаар танд бүх чиглэл, ойр байрлах зогсоолууд харагдана. Мөн та хайх хэсгээс чиглэл болон зогсоолоор хайлт хийх бүрэн боломжтой. ",
    },
    {
      title: "Автобус хаана явж байгааг хэрхэн мэдэх вэ?",
      content:
        "Зогсоол, чиглэл хайх хэсэгт автобусны чиглэлийг бичиж хайлт хийснээр тухайн чиглэлийн зогсоолууд листээр харагдах бөгөөд автобусны тэмдэгт хэлбэрээр үйлчилгээнд явж буй автобус харагдана. Энэ нь автобус тухайн зогсоол дээр байгаа болон очиж байгааг илтгэнэ. Мөн газрын зураг гэсэн хэсгийг доош татан автобуснуудыг бодит цагт газрын зураг дээр харах боломжтой.",
    },
    {
      title: "Карт борлуулах цэгийг хэрхэн харах вэ?",
      content:
        "Баруун доор байлрах товчин дээр даран Карт борлуулах цэгүүдийн байршлыг харах боломжтой бөгөөд Замчлуулах хэсэг дээр дарж газрын зураг дээр замаа заалгах боломжтой.",
    },
    {
      title: "Хэрхэн өөрт ойр байгаа зогсоолыг харах вэ?",
      content:
        "Баруун доор байрлах товчин дээр дарж Ойр зогсоолууд хэсгийг харвал таньд хамгийн ойр байрлах зогсоолын зайг харуулна.",
    },
    {
      title: "Хэрхэн очих газрынхаа явах чиглэлийн автобусыг харах вэ?",
      content:
        "Зүүн доор товчин дээр дарж Замчлуулах меню руу орно. Эхлэх байршил хэсэгт та өөрийн байршлыг газрын зургаас сонгон зааж өгнө. Үүний дараа очих газрын байршлыг газрын зургаас эсвэл нэрээр нь хайж оруулан сонгох товчийг дарснаар тухайн чиглэлд явж буй боломжит автобусны чиглэлүүд гарч ирнэ.",
    },
    {
      title: "Буух буудлаа дөхөж ирснийг хэрхэн мэдэх вэ?",
      content:
        "Та автобусанд QR кодоо уншуулж зорчих бөгөөд таны үүсгэсэн QR код дээр таны зорчиж буй автобусны чиглэл гарч ирнэ. Үүний дараа сэрүүлэг хэсгийг идэвхжүүлснээр таны буух буудлаас 100м-ийн өмнө сэрүүлэг дуугарч",
    },
  ];

  return (
    <div id="FAQ">
      <div className=" my-10 sm:my-20">
        <ColorWrapper color={"transparent"}>
          <div className="flex flex-col items-center justify-center px-4 sm:px-0">
            <div className="flex items-center flex-grow justify-center">
              <h1 className="flex text-4xl sm:text-6xl md:text-5xl items-center justify-center text-center mb-10">
                Түгээмэл асуултууд
              </h1>
            </div>

            <div className="flex w-full sm:w-3/4 lg:w-2/4 justify-center items-center">
              <div className="flex-1">
                <Accordion value={null}>
                  {items.map((item, index) => (
                    <AccordionItem
                      key={index}
                      value={index.toString()}
                      trigger={item.title}
                    >
                      <div className="p-1 text-gray-700 text-sm font-normal leading-relaxed">
                        {item.content}
                      </div>
                    </AccordionItem>
                  ))}
                </Accordion>
              </div>
            </div>
          </div>
        </ColorWrapper>
      </div>
    </div>
  );
}
